contactUs-load-test.yml
config:
  target: http://webdriveruniversity.com/Contact-Us/contactus.html
  phases:
    - arrivalRate: 1
      duration: 10
  engines:
    playwright:
      launchOptions:
        headless: false
  processor: "./tests/webdriver-university/contactUs.spec.js"
scenarios:
  - name: "FillAll"
    engine: playwright
    flow: []
    flowFunction: "FillForm"

  - name: "NoFill"
    engine: playwright
    flow: []
    flowFunction: "EmptyForm"

  - name: "PartialFill"
    engine: playwright
    flow: []
    flowFunction: "PartialFillForm"