contactUs-load-test.yml
config:
  target: http://webdriveruniversity.com/Contact-Us/contactus.html
  phases:
    - arrivalRate: 1
      duration: 6
  engines:
    playwright:
      launchOptions:
        headless: false
  processor: "./fill-form.js"
scenarios:
  - name: "Contact Us page"
    engine: playwright
    flowFunction: "FillForm"
    flow: []